{
    "modelTopology": {
        "keras_version": "2.1.5",
        "model_config": {
            "class_name": "Model",
            "config": {
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "inbound_nodes": [],
                        "config": {
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                416,
                                416,
                                3
                            ],
                            "name": "input_1",
                            "sparse": false
                        },
                        "name": "input_1"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_1",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 16,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_1"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_1"
                        },
                        "name": "batch_normalization_1"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_1"
                        },
                        "name": "leaky_re_lu_1"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ]
                        },
                        "name": "max_pooling2d_1"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_2",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 32,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_2"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_2"
                        },
                        "name": "batch_normalization_2"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_2"
                        },
                        "name": "leaky_re_lu_2"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "name": "max_pooling2d_2",
                            "trainable": true,
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ]
                        },
                        "name": "max_pooling2d_2"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_3",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 64,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_3"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_3"
                        },
                        "name": "batch_normalization_3"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_3"
                        },
                        "name": "leaky_re_lu_3"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "name": "max_pooling2d_3",
                            "trainable": true,
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ]
                        },
                        "name": "max_pooling2d_3"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_4",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 128,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_4"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_4"
                        },
                        "name": "batch_normalization_4"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_4"
                        },
                        "name": "leaky_re_lu_4"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "name": "max_pooling2d_4",
                            "trainable": true,
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ]
                        },
                        "name": "max_pooling2d_4"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_5",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 256,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_5"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_5"
                        },
                        "name": "batch_normalization_5"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_5"
                        },
                        "name": "leaky_re_lu_5"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "name": "max_pooling2d_5",
                            "trainable": true,
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ]
                        },
                        "name": "max_pooling2d_5"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_6",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 512,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_6"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_6"
                        },
                        "name": "batch_normalization_6"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_6"
                        },
                        "name": "leaky_re_lu_6"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "name": "max_pooling2d_6",
                            "trainable": true,
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ]
                        },
                        "name": "max_pooling2d_6"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling2d_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_7",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 1024,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_7"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_7"
                        },
                        "name": "batch_normalization_7"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_7"
                        },
                        "name": "leaky_re_lu_7"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_8",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.0005000000237487257,
                                    "l1": 0.0
                                }
                            },
                            "filters": 512,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "use_bias": false,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ]
                        },
                        "name": "conv2d_8"
                    },
                    {
                        "class_name": "BatchNormalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "beta_constraint": null,
                            "scale": true,
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "center": true,
                            "epsilon": 0.001,
                            "trainable": true,
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "gamma_regularizer": null,
                            "gamma_constraint": null,
                            "axis": -1,
                            "beta_regularizer": null,
                            "momentum": 0.99,
                            "name": "batch_normalization_8"
                        },
                        "name": "batch_normalization_8"
                    },
                    {
                        "class_name": "LeakyReLU",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "alpha": 0.10000000149011612,
                            "trainable": true,
                            "name": "leaky_re_lu_8"
                        },
                        "name": "leaky_re_lu_8"
                    },
                    {
                        "class_name": "Conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "config": {
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "scale": 1.0,
                                    "seed": null,
                                    "mode": "fan_avg"
                                }
                            },
                            "name": "conv2d_9",
                            "bias_regularizer": null,
                            "bias_constraint": null,
                            "activation": "linear",
                            "trainable": true,
                            "data_format": "channels_last",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
